{"LIST":{"biographies":[{"data":{"id":"parthraghav","content":"Senate is an incredible opportunity to connect the students with the institution and administration that are responsible for not only our education, but also for our well-being. During my years at Reed so far, I have constantly felt a responsibility towards bettering the community we’re all apart of. To begin, I served as Senate secretary last semester (Fall of 2018) and was able to learn an incredible amount about the complex and, frankly, laborious processes our Senate has to go through to voice student opinion in order to protect Reedies’ best interests. It was incredibly enlightening to be able to work with fellow students who not only took the time out of their busy schedules to solve students’ issues, but who were also dedicated to improving the institution for future students. My work with Senate earlier was predominantly defined by my involvement with the Students’ Committee on Academic Policy and Planning (SCAPP). I was fortunate to be introduced to this process and the faculty members and students responsible for the structure and content of our education. However, while attending the public SCAPP meetings, I was initially surprised to see nearly no students outside of the committee attending to voice their concerns. Considering the prevalent and extremely vital discourse that takes place on campus about group requirements, syllabi, etc., I was curious to know why people weren’t in the room to openly share their opinions. I would like to serve as a point-person for this purpose and allow students to feel like they have a direct line to these issues. Although it is not an exclusive club, I understand that these issues feel inaccessible at times and I would like to mend that. Another project I would like to develop would be a student committee for the Committee on Diversity. Although senate representatives are invited to sit in on official meetings, I think it could be beneficial for there to be institutional involvement by the students themselves in addressing these very pertinent issues. Although we have several incredible, staff-led programs on campus, it would be a formal opportunity to allow students to take part in this topic, a vital aspect of our institution. Lastly, please let me know if there’s anything you’d like to see me or our Senate in general address as the year goes on (my email is mangiap@reed.edu, and my office hours are Monday 11am-12pm in the Paradox Nu Shop by the library). We are here to hear your thoughts and get things done!"}},{"data":{"id":"apoorvamangipudi","content":"Senate is an incredible opportunity to connect the students with the institution and administration that are responsible for not only our education, but also for our well-being. During my years at Reed so far, I have constantly felt a responsibility towards bettering the community we’re all apart of. To begin, I served as Senate secretary last semester (Fall of 2018) and was able to learn an incredible amount about the complex and, frankly, laborious processes our Senate has to go through to voice student opinion in order to protect Reedies’ best interests. It was incredibly enlightening to be able to work with fellow students who not only took the time out of their busy schedules to solve students’ issues, but who were also dedicated to improving the institution for future students. My work with Senate earlier was predominantly defined by my involvement with the Students’ Committee on Academic Policy and Planning (SCAPP). I was fortunate to be introduced to this process and the faculty members and students responsible for the structure and content of our education. However, while attending the public SCAPP meetings, I was initially surprised to see nearly no students outside of the committee attending to voice their concerns. Considering the prevalent and extremely vital discourse that takes place on campus about group requirements, syllabi, etc., I was curious to know why people weren’t in the room to openly share their opinions. I would like to serve as a point-person for this purpose and allow students to feel like they have a direct line to these issues. Although it is not an exclusive club, I understand that these issues feel inaccessible at times and I would like to mend that. Another project I would like to develop would be a student committee for the Committee on Diversity. Although senate representatives are invited to sit in on official meetings, I think it could be beneficial for there to be institutional involvement by the students themselves in addressing these very pertinent issues. Although we have several incredible, staff-led programs on campus, it would be a formal opportunity to allow students to take part in this topic, a vital aspect of our institution. Lastly, please let me know if there’s anything you’d like to see me or our Senate in general address as the year goes on (my email is mangiap@reed.edu, and my office hours are Monday 11am-12pm in the Paradox Nu Shop by the library). We are here to hear your thoughts and get things done!"}},{"data":{"id":"billyfish","content":"Howdy! My name is Billy Fish (he/him) and I am from Camp Hill, Pennsylvania. I am a physics major and I joined Senate in Spring 2019. I never visited Reed (or the west coast for that matter) and didn’t know a whole lot about it before I flew out here Fall 2017. But ever since, I became very passionate about this place and the people it attracts – and I love spending my time being involved around campus. Here are some areas of focus and projects I wish to work on throughout my time on Senate: - Sustainability: Communicating and implementing the recommendations in the 2019 Reed Climate Action Plan (CAP), working with the sustainability coordinators and Greenboard to support existing projects such as composting, working with members of the Board of Trustees to invest parts of the endowment in green venture capital, and promoting direct action opportunities. - HCC: Working with HCC staff and administration to communicate information to students (esp. scope of practice), increasing the diversity of clinicians at the HCC, increasing financial and physical accessibility of care, working with the new Counseling Director, Medical Director, and Dean for Student Health and Wellbeing to make reorganization in the Student Life division work best for students, creating programs focused on prevention and wellness, increasing awareness of symptoms of mental health problems and how to address them, creating a student health advisory board to the administration, addressing malpractice, and promoting broad culture change which understand that mental and physical health are important parts of the academic experience. - Student Experience: Assisting in resource wayfinding, promoting institutional memory (such as through the SBHB and Senate website), increasing accessibility of student spaces, linking the garden to the Community Pantry, and increasing the amount of resources available to marginalized students (esp. low SES and racial minorities). Outside of Senate, I am a HA, a telescope operator, and I play on the Reed soccer team."}},{"data":{"id":"alisachen","content":"Hi y'all, my name is Alisa (uh-lee-shuh) and I'm an anthropology major Chinese minor from Michigan. I really, really want a cat, and frequently think about taking my readings and going on a hike and reading on top of a mountain though that doesn't seem practical, especially as we leave summer behind. I baked over 40 pounds worth of flour into bread this summer, so you can call me Bread Master if you want, and I also like ice hockey and learning Mandarin. On Senate, I've mostly focused on issues related to food security on campus and have been on AppComm for two semesters and am the current AppComm Chair. If you're down to clown, come to commons from 10-11 on Mondays and you can listen to me and Aziz scream. Also, if you have leftover board points at the end of the year, you better remember to donate them to the Pantry. And always remember never forget, to risk it for the biscuit."}},{"data":{"id":"gaberogers","content":"Hi y’all, I’m Gabe, and as your Senator, I’m working towards adjusting and reinvigorating some of the aspects of Senate that function poorly. To that end, I believe the biggest steps I can take are Bylaw revision and election reform. Many students at this school, likely a vast majority, have never looked at, or even heard of, the Senate Bylaws. That’s because, as they exist now, the Bylaws only act as non-binding rules and statutes set in place by the Senate. They are quite dense, and even when you’re able to parse them, they will frequently not contain needed or relevant information. I want the Bylaws to be the document people can turn to in order to understand the Senate. Have a question about how funding for a student group works? Well, take a look at the section on student funding, with examples and instructions alongside it for if you want to get a club funded yourself. Unsure about how recounts work for an election? Check the election recount section, with some handy historical precedents of how they’ve been handled before, and a set standard of how they should be handled moving forwards. Maybe a few Commonly Asked Questions at the end of each major section. All this would make engaging with Senate less cumbersome, and would provide a kind of guidebook for those looking for one. Election reform is the other key program I want to initiate while on Senate. Participation in the last many elections has been weak at best, and in the past few years there have frequently been extensions of deadlines so that the vote can reach quorum. I think that the reason for this disconnect between the student body and Senate is the difficulty and opaqueness of participation with student government. The majority of students don’t vote, and many of those that do only heard of the candidates when they read their names on the ballot. To attempt to solve this problem, I have a number of ideas, which will be elaborated on and explored through discussion and trial and error. Things like holding elections at the beginning of the semester, rather than during finals week when students are at their busiest; distributing ballots into classrooms with a small chunk of time set aside for them, similar to how teacher evaluations function; and holding open question and answer sessions between candidates and members of the student body during the elections, so that students can be more well-informed on candidates stances without having to attend the singular meeting at which every candidate announces their campaign. Reed elections could be so much more, and I hope to be able to get it at least part of the way. Thanks for taking the time to read this, and have a pleasant and mirthful afternoon."}},{"data":{"id":"frankgaunt","content":"Hi all, I'm Frank, a senior Economics major from Columbia, Missouri! I've been on Senate since my sophomore year (this will be my fifth and last semester on it!). However, I haven't actually been a voting member until this semester (I was previously Secretary, Assistant Treasurer, and Vice Treasurer). Last year I was on the Presidential Search Committee, and I've been (sometimes intermittently) involved with S-CAPP for years now! This semester, I'm trying to get back to the basics: cutting checks for student groups and making sure Treasury passes its audit."}},{"data":{"id":"jonathanlederman","content":"Hi, I'm Jonathan Lederman and I work to represent disabled students in administrative processes and broaden Reed's approach to accessibility. Accessibility culture at Reed, to me, means a campus where people with disabilities are accommodated, accepted, and valued, and where people can advocate for their own needs and find the resources they ask for.  Currently, I am petitioning for a student advocacy coordinator position for students, and am helping Accessibility Committee with a number of projects that will make Reed more accessible for all visitors. I also want to tackle the financial and academic hardship that disability can present at Reed."}},{"data":{"id":"shulavneupane","content":"Hi all, I am Shulav Neupane, a Math-Econ senior from Nepal. I care deeply about academic reform, and have been actively working on it for a couple years as a member of the Student Committee on Academic Policy and Planning (SCAPP). As a senator, I  have more platforms to address academic issues such as concerns regarding academic advising and equity in Reed’s educational program. Also, as an international student who has been very involved in the community through mentor programs and as an intern at the International Student Services office, I bring the perspective of international students as a senator, which many people in the community feel is lacking. You can email me at neupanes@reed.edu if you have any questions or concerns. Thanks!"}},{"data":{"id":"pixiefreeman","content":"Oh boy. I heard you all like some stream of consciousness esque writing so thats what i'm gonna give you. I somehow am still at Reed and I care a lot about this little school. I'm truly not sure how I got here or how I am still here and attending classes and meetings. Y'all why do we do what we do for this school? I really couldn't answer that. I traveled across the country to a place that is really far away from my home. Leaving that community was harder than most things I have done. I have found myself in the confused and misguided and caring community that is reedies and this community has taken care of me in so many ways. (And made me cry and want to quit and go home and curl up into a ball and never come out) But really this community is what has kept me here. And I feel like I need to find a way to nurture that community so that it can continue to support reedies now and hopefully in the future. Senate has so much nebulous responsibility, and as a senator I never really felt like I knew if I was making an impact on anyone's life. (Not once in the entire semester did someone come to my office hours.) Now, as the VP and as the SOS chair, I know that, in some small ways, I can say that I am contributing something to the lives of the people around me. (Someone has come to (my treasury) office hours every day that I have had them!!) Being able to give SB funds to students who need them, and who care about this college and want to foster community has made me so hopeful in this position. Y'all, please come to my office hours if you have questions about SB funds (I will probably be able to answer 2/3rds of them and I can get the other information for you.) or if you have questions about emergency funds (SOS can help you!) or if you have questions about how to talk to the faculty and staff and administrators at this college (some of them are fucking scary and I would love to meet you in that battle). Or like literally anything. Pax and I's office hours will always be a riot and we would love to have someone step in to give us something other than straight execentalism to think about. Okay. That was a lot. I hope I see you around campus! Look at me if you see me and give me a hand signal so I know you're alive!"}},{"data":{"id":"azizoudraogo","content":"Yeah, that’s Aziz. Pretty cute right? Yeah, we know, that’s why we elected him. Believe it or not Aziz can do more than just look pretty. While we initially thought he was just tall, dark, and adorable, we’ve come to realize that he’s actually pretty funny too. While quite expensive and rather high maintenance we, Reed College, easily justified the purchase of the Aziz 2019-2020 model. Harvested locally from a brown woman in Boise, Idaho, this investment ensures only the finest in teamwork, grace, innovation, and the superiority of the brown race. Above all else, the goal of this Student Body acquisition is to drive Student Success, and in a manner quite similar to the late and great Kim Possible, Aziz can always be called, or beeped, whenever she may need to be reached. Although Aziz is beautiful, it doesn’t excuse the fact that when he’s not hard at work, she can usually be found getting the most out of his Crunchyroll Premium membership."}},{"data":{"id":"salmahuque","content":"Hey, I’m Salma (she/her). I’m one of the three treasurers and we administer the student body funds. Let me know if you have any questions or confusion, I’m here to help :)"}}],"users":[{"data":{"id":"apoorvamangipudi","name":"Apoorva Mangipudi","imgUrl":"http://lorempixel.com/300/200/","shortPosition":"Senator","position":"Senator: Student Committee on Academic Policy and Planning (S-CAPP), Appeals Board, Committee on Diversity (COD), Liason for Office of Inclusive Diversity (OID), Appointments Committee","pronouns":"He/Him","class":"2021","major":"History","reign":"Fall 2019","bio":"decolonize this beat","contact":"Email: mangiap@reed.edu","officeHours":"Monday, 11am-12pm in the Paradox Nu Shop"}},{"data":{"id":"billyfish","name":"Billy Fish","imgUrl":"https://lh3.googleusercontent.com/9ORfszJlCFxYX3OX1EO7YMEwy5aXg1MFheCxVrOi2XaEht4Oh8Co5PXs5sWsYr3qLS4_jsD4MOWhF_i__g6O6Usq2DXMpZxtKdGSG9KJAV6bNEXrFW3TrBLilUAEcxUDgbsJ1Lws","shortPosition":"Senator","position":"Senator, Sustainability Committee, Physical Plant Committee, CEP Liaison, HCC Liaison","pronouns":"He/Him","class":"2021","major":"","reign":"Fall 2019","bio":"Embrace the suck","contact":"Email: wfish@reed.edu","officeHours":"Monday 1pm to 2pm in Commons"}},{"data":{"id":"alisachen","name":"Alisa Chen","imgUrl":"https://lh3.googleusercontent.com/m57n1LrTkWel7QH06ChQRh8ZYGTZIswfT_O-kf-lmjwqCc7p67kY7CU5YskSFprGhAxyzpZkyFkR7P_x0ZRt1RwQclDgQvj41oxcLxW7qz_mYQtDuDO0-ISVTFneEIjsEnldbqb0","shortPosition":"Senator","position":"Senator and AppComm Chair, Liaison to HC, RJ, and J-Board ","pronouns":"He/Him","class":"2022","major":"","reign":"Fall 2019","bio":"Risk it for the Biscuit","contact":"Email: alichen@reed.edu","officeHours":"Monday 10am-11am"}},{"data":{"id":"gaberogers","name":"Gabe Wilkie-Rogers","imgUrl":"https://lh4.googleusercontent.com/Q6wmZBSQF6kwAY5THvu-OY2WR-NKMUA6OFMOLL5GIu_9PQ0KKTW4a3uVCfgoHaj7W02JWXPdSyegOOPBAYkRH_O5pETJ8fsS6Z-uOLhnB8VCd3K4dD3F-IfFGVLBvcW3IlNzu_2H","shortPosition":"Senator","position":"Senator, Liaison to Community Safety, Member of SOS, Murals, and Website Committees","pronouns":"He/Him","class":"2021","major":"Theatre","reign":"Fall 2019","bio":"Come to office hours","contact":"Email: wilkierg@reed.edu","officeHours":"Tuesdays/Thursdays 3:15 - 4:15 in the Student Union"}},{"data":{"id":"frankgaunt","name":"Frank Gaunt","imgUrl":"https://lh4.googleusercontent.com/xabP_r4quP2j_G5Afi-zI5LMZnKtQRrzZub4e_HrjhZpL8mda29lNAvl9-w3SGCSVBn4c_vlFwVL5xxYxfXf4YQDfmWch28kgcLwhPFyRpnOc_qrO_bdIp7pbrclfbFU9emoZJL0","shortPosition":"Head Treasurer","position":"Head Treasurer/Finance Committee & S-CAPP","pronouns":"He/Him","class":"2020","major":"Economics","reign":"Fall 2019","bio":"Just. One. More. Semester","contact":"Email: money@reed.edu","officeHours":"Friday 1-3pm in the Treasury Office"}},{"data":{"id":"jonathanlederman","name":"Jonathan Lederman","imgUrl":"https://lh6.googleusercontent.com/dAn-bNRBwCSdM5v15td7pIylIBjDiUUkwc040DQjwBYuT7QVRq2HLIT1naQRze4tjNPTcAh6NbtYpEIML4hQRer-w-0OxGkpQ5ZMIxoku4MPqFRTcvF2ZyYT9gcsWOxUV61T2hoE","shortPosition":"Senator","position":"Second term senator; liaison to DAR, Academic Support, Commons, and Res Life; representative on Accessibility Committee","pronouns":"He/Him","class":"2021","major":"History","reign":"Fall 2019","bio":"Accessibility is about more than just ADA compliance!","contact":"Email: ledermaj@reed.edu","officeHours":"Tuesday/Thursday 10-11AM in Commons"}},{"data":{"id":"shulavneupane","name":"Shulav Neupane","imgUrl":"http://lorempixel.com/300/200/","shortPosition":"Senator","position":" Senator: Liason for CLBR, ISS and in student success committee, website committee and scapp","pronouns":"He/Him","class":"2020","major":"Math-Economics","reign":"Fall 2019","bio":"Lads it’s Tottenham!","contact":"Email: neupanes@reed.edu","officeHours":"Tuesday 11-12PM Commons"}},{"data":{"id":"pixiefreeman","name":"Pixie Freeman","imgUrl":"https://lh6.googleusercontent.com/CCchwcqMBsBPWztNaYmL-8eMO5rfvyM2XrSenvhGy69M5u4skSgbTo5kgBJB_O5zq-f1nRM7U10BPt8z2f22GJrdqg8j99XGB_Vig0NLjYIVIhDoNQTi8tCt0n4ojnQ12bGgmPNq","shortPosition":"Vice President","position":"SB Vice President / SHARE-Liason, Alumni Liaison / AFAC, SOS, Website Committee","pronouns":"He/Him","class":"2020","major":"ES / Poli Sci","reign":"Fall 2019","bio":"Econ bros are the worst bros","contact":"Email: pifreeman@reed.edu","officeHours":"Wednesday 10-11 in the Treasury Office, Wednesday 11-12 in the Exec Office, and Thursday 3-4 in the Exec Office"}},{"data":{"id":"azizoudraogo","name":"Aziz Ouedraogo","imgUrl":"https://lh4.googleusercontent.com/MclWosNrPOjYfjCOmv4pYbWQRTTzNb5ZhFMCSgdxoZe6ZDCJIREKXa3kzkeVTdfUFR18qKshxz3x-vhg8utu2vXAFv9knS8q-iZhSzOPv0Bm0pZGkwmPrzUHSkUNzlFUleWcyQKW","shortPosition":"Senator","position":"Senator, Appointments Committee, Student Success Committee, Committee on Diversity, Legislation Committee, Student Opportunity Subsidy Committee.","pronouns":"He/Him","class":"2021","major":"Biochemistry","reign":"Fall 2019","bio":"If I don't get my way everyone suffers","contact":"Email: aziouedra@reed.edu, Phone: 208-805-7014","officeHours":"Monday 10-11 in Commons w/ Alisa"}},{"data":{"id":"salmahuque","name":"Salma Huque","imgUrl":"http://lorempixel.com/300/200/","shortPosition":"Vice Treasurer","position":"Vice Treasurer Liaisonships/Committees: Renn Fayre Committee, Student Opportunity Subsidy (SOS) Committee, Student Committee on Academic Policy and PLanning (SCAPP), Computer User Services (CUS) liaison, Library Board","pronouns":"She/Her","class":"2020","major":"","reign":"Fall 2019","bio":"mail fraud","contact":"Email: huques@reed.edu","officeHours":"Tuesdays 1-3pm in Treasury Office"}}]}}